def area(a, b):
    ''' Функция Вычисляет площадь прямоугольника по длине прямоугольника и ширине прямоугольника.
         Параметры:
             a(float) : длина прямоугольника.
             b(float) : ширина прямоугольника.
         Возвращаемое значение:
             Площадь квадрата(по формуле длина прямоуголльника * ширину прямоугольника).'''
    return a * b

def perimeter(a, b):
    ''' Функция Вычисляет площадь прямоугольника по длине прямоугольника и ширине прямоугольника.
         Параметры:
             a(float) : длина прямоугольника
             b(float) : ширина прямоугольника
         Возвращаемое значение:
             Площадь прямоугольника(по формуле (длина прямоуголльника + ширину прямоугольника)*2)'''
    return (a + b)*2