
def area(a):
# Функция Вычисляет площадь квадрата по длине его стороны.
    #Параметры:
        #a(float) : сторона квадрата
    # Возвращаемое значение:
        # Площадь квадрата(по формуле длина стороны * длина стороны)
    return a * a

def perimeter(a):
# Функция Вычисляет периметр квадрата по длине его стороны.
    # Параметры:
        # a(float) : сторона квадрата
    # Возвращаемое значение:
        # периметр квадрата(по формуле длина стороны * количество сторон(у квадрата 4))
    return 4 * a
